app/Models/Dashboardu/MaterialModel.php

    public function getByUser($user_id)
    {
        return $this->where('user_id', $user_id)->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `materials`
WHERE `user_id` = '3'
ORDER BY `created_at` DESC

    public function getById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `materials`
WHERE `materials`.`id` = '2'