app/Controllers/User/DashboardUser.php

SELECT *
FROM `materials`
WHERE `is_approved` IN (1,2)
ORDER BY `approved_at` DESC
---
    public function index()
    {
        $materi = $this->materialModel
            ->whereIn('is_approved', [1, 2]) // tampilkan yang disetujui dan tertutup
            ->orderBy('approved_at', 'DESC')
            ->findAll();