app/Controllers/Guest/GuestController.php

    public function index()
    {
        $materiModel = new MaterialModel();
        $materi = $materiModel
                    ->where('is_approved', 1)
                    ->findAll();
---
SELECT *
FROM `materials`
WHERE `is_approved` = 1